#include <stdio.h>
#include <stdlib.h>


void main()
{
	int a[10], b[3][4];
	int *p1, *p2, **p3;

	int i, j;



	for(i=0; i < 10; i++)
	{
		printf("请输入一维数组 10个元素[%d]:\n", i);
		scanf("%d", &a[i]);
	}



	for (i = 0; i<3; i++)
	{
		for (j=0; j<4; j++)
		{
			printf("请输入3行4列二维数组【%d】【%d】,",i,j);
			scanf("%d", &b[i][j]);
		}
	}
	printf("\n");

//分别给一维指针p1和二维指针p3 赋初始值

	for(p1=a, p3=&p1, i=0; i<10; i++)//用二维指针变量输出一维数组，二维指针变成一维指针，*(*p+i)的方式
	{
		printf("%4d", *(*p3+i));	//(*p3+i)等同于(p1+i)    *(p1+i)等同于a[i]
	}
	printf("\n");

	for(p1=a; p1-a<10; p1++)	//用二维指针变量输出一维数组， 保持二维指针变量， 改变一维指针指向的位置**p3不变， p1++来变
	{
		p3 = &p1;
		printf("%4d", **p3);	//(*p3)等同于*(&p1)等同于p1，获取到p1变量保存的地址 (**p3)等同于a[i]
	}
	printf("\n");


	for(i = 0; i < 3; i++)		//二维指针输出二维数组，**p3; p3 = &b[i]; *(*p3+j)
	{
		p2 = b[i];				//这个p2 = b[i]等同于  p2 = &b[i][0]
		p3 = &p2;				//p3 = &p2, p3是一个指向指针p2的指针， p3存着p2的地址
		for (j = 0; j < 4; j++)
		{
			printf("%4d", *(*p3+j));//(*p3+j) 等同于  *(&p2)+j 等同于 p2+j 等同于 &b[i][0]+j  等同于 &b[i][j]
		}							//*(*p3+j) == *（&b[i][j]） == b[i][j]
		printf("\n");
	}

	for (i = 0; i < 3; i++)	//二维指针输出二维数组，**p3  *p2; p3 = &p2;保持p3不变， 改变p2 变成b[i][j]
	{
		p2 = b[i];				//&p2 = b[i][0]  决定第i行
		for (p2=b[i]; p2-b[i]< 4; p2++)//		决定第j列， p2++ 要理解成b[i][n++]
		{
			p3 = &p2;
			printf("%4d", **p3);
		}
		printf("\n");
	}
}
/*
二维指针，表示：一个指针变量，指向另一个指针变量，
float **ptr;  *是自右向左结合， 相当于float *(*ptr)
float f = 5.0		定义一个实型变量f = 5.0
float *point = &f;	//定义一个实型的指针变量，并且用f的地址进行初始化
float **ptr = &point; 定义一个二维指针变量， 并用指针变量point的地址来初始化

二维指针表示一维数组，  a[10], int **p ,  p=a
二维指针表示二维数组，  b[3][4], int **p, p=b 或者  *p2, p2=b[i], p=&p2
*/

/*

C:\Users\Administrator>D:\代码仓库\C语言精彩编程百例\42.二维指针.exe
请输入一维数组 10个元素[0]:
0 1 2 3 4 5 6 7 8 9
请输入一维数组 10个元素[1]:
请输入一维数组 10个元素[2]:
请输入一维数组 10个元素[3]:
请输入一维数组 10个元素[4]:
请输入一维数组 10个元素[5]:
请输入一维数组 10个元素[6]:
请输入一维数组 10个元素[7]:
请输入一维数组 10个元素[8]:
请输入一维数组 10个元素[9]:
请输入3行4列二维数组【0】【0】,1
请输入3行4列二维数组【0】【1】,2
请输入3行4列二维数组【0】【2】,3
请输入3行4列二维数组【0】【3】,4
请输入3行4列二维数组【1】【0】,5
请输入3行4列二维数组【1】【1】,6
请输入3行4列二维数组【1】【2】,7
请输入3行4列二维数组【1】【3】,8
请输入3行4列二维数组【2】【0】,9
请输入3行4列二维数组【2】【1】,10
请输入3行4列二维数组【2】【2】,11
请输入3行4列二维数组【2】【3】,12

   0   1   2   3   4   5   6   7   8   9
   0   1   2   3   4   5   6   7   8   9
   1   2   3   4
   5   6   7   8
   9  10  11  12
   1   2   3   4
   5   6   7   8
   9  10  11  12
*/


